Дневник_трейдера/src/Documents/ВнутридневныеДанныеБрокерскогоОтчета/ВнутридневныеДанныеБрокерскогоОтчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВнутридневныеДанныеБрокерскогоОтчета</name>
  <registerRecords>AccumulationRegister.ВнутридневныеСделки</registerRecords>
  <attributes>
    <name>БрокерскийСчет</name>
    <type>
      <types>CatalogRef.БрокерскиеСчета</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДневныеДанные</name>
    <attributes>
      <name>ЦеннаяБумага</name>
      <type>
        <types>CatalogRef.ЦенныеБумаги</types>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПокупки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПродажи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаКомиссий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФинансовыйРезультат</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Дневник_трейдера/src/AccumulationRegisters/ВнутридневныеСделки/ВнутридневныеСделки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВнутридневныеСделки</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>СуммаПокупки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаПродажи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКомиссий</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФинансовыйРезультат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>БрокерскийСчет</name>
    <type>
      <types>CatalogRef.БрокерскиеСчета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЦеннаяБумага</name>
    <type>
      <types>CatalogRef.ЦенныеБумаги</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Дневник_трейдера/src/Documents/ВнутридневныеДанныеБрокерскогоОтчета/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ВнутридневныеСделки 
	Движения.ВнутридневныеСделки.Записывать = Истина;
	Для Каждого ТекСтрокаДневныеДанные Из ДневныеДанные Цикл
		Движение = Движения.ВнутридневныеСделки.Добавить();
		Движение.Период = НачалоДня(Дата);
		Движение.БрокерскийСчет = БрокерскийСчет;
		ЗаполнитьЗначенияСвойств(Движение, ТекСтрокаДневныеДанные);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
